/* ---------------------------------------------------------------------------------------------------------------------------------
 * OnStepX 扩展配置文件 - 不常用选项
 *
 *          关于 OnStep 的配置详情请参见 http://www.stellarjourney.com/index.php?r=site/equipment_onstep 
 *                      并加入 OnStep Groups.io 群组：https://groups.io/g/onstep
 * 
 *           *** 阅读编译器的警告和错误信息，它们用于帮助防止无效配置 ***
 *
 * ---------------------------------------------------------------------------------------------------------------------------------
 * 调整以下内容以配置你的控制器功能 ----------------------------------------------------------------------
 * <-必须项 = 始终必须设置, <-常用项 = 通常需要设置, 可选项 = 可选, 调整项 = 根据需要调整, 不常用 = 极少修改
*/
//      参数名称                   取值   默认值  说明                                                                        提示

// =================================================================================================================================
// 控制器 ======================================================================================================================

// 调试功能 -----------------------------------------------------------------------------------------------------------------------
// 在指定的调试串口上启用额外调试/状态信息（使用完毕请务必关闭！）
// 注意：调试串口通常（几乎总是）与串口A共用，因此无法用于正常的
//       LX200 协议通信。如果是这种情况，请将两者设置为相同的（更高）波特率。
#define DEBUG                         OFF // 关闭，开启仅输出后台错误信息，详细模式输出所有错误和状态信息，
                                          //         控制台模式用于VT100调试控制台，
                                          //         分析器模式用于VT100任务分析器。                                 不常用
#define DEBUG_AXIS                    OFF // 关闭，轴号 1~9，指定需要记录日志的轴。                                       可选项
#define DEBUG_CAN                     OFF // 关闭，开启记录CAN接口统计信息。                                             可选项
#define DEBUG_ECHO_COMMANDS           OFF // 关闭，开启或仅错误模式，将命令输出到调试串口。                               可选项
#define SERIAL_DEBUG               Serial // Serial，使用可用硬件串口：Serial1、Serial2 等。                             可选项
#define SERIAL_DEBUG_BAUD          230400 // 230400，波特率：9600,19200,57600,115200,230400,460800（常用波特率）            可选项

// 非易失性存储 -------------------------------------------------------------------------------------------------------------------
#define NV_WIPE                       OFF // 关闭，将默认参数写入非易失性存储器（闪存/EEPROM等）。                         不常用
                                          // *** 重要：启用此选项后上传固件，等待1~2分钟，
// 警告 --->                           // *** 然后将此选项设为关闭并再次上传。
                                          // *** 保持此选项开启会导致非易失性存储器过度磨损，
                                          // *** 损坏控制器的非易失性存储系统！
// ---------------------------------------------------------------------------------------------------------------------------------